/***********************************************************
  > File Name: 9.c
  > Author: rose
  > Mail: 483086134@qq.com
  > Created Time: 2025年01月18日 星期六 15时53分17秒
    > Modified Time:2025年01月18日 星期六 15时58分47秒
 *******************************************************/

#include <stdio.h>

int main()
{
    int a,b,c;
    for(a=0;a<=20;a++){
        for(b=0;b<=33;b++){
            c=100-a-b;
            if(c%3 == 0 && (5*a+3*b+c/3)==100){ // 检查c是否是3的倍数
                printf("鸡翁：%d，鸡母：%d，鸡雏：%d\n",a,b,c);
            }
        }
    }
    return 0;
}


